app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "email", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "fff"], ["email", "fff"], ["body", "fff"], ["post_id", 9], ["created_at", "2017-09-16 16:47:45.340968"], ["updated_at", "2017-09-16 16:47:45.340968"]]
---
  def create
    @post = Post.find params[:post_id]
    @comment = @post.comments.new(comment_params)
    if @comment.save