app/controllers/posts_controller.rb

SELECT  posts.*, count(comments.id) as comment_count FROM "posts" INNER JOIN "comments" ON "comments"."post_id" = "posts"."id" GROUP BY posts.id ORDER BY comment_count DESC LIMIT ?  [["LIMIT", 5]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts"
---
  def index # displays all posts (the newest posts first)

    @lastcommentedposts =  Post.select('posts.*, max(comments.created_at) as last_commented_at').joins(:comments).group('posts.id').order('last_commented_at DESC').limit(5)
    @bestposts = Post.select('posts.*, count(comments.id) as comment_count').joins(:comments).group('posts.id').order('comment_count DESC').limit(5)
    @subscriber = Subscriber.new

    if params[:search]
      @posts = Post.search(params[:search]).order("created_at DESC")
    else
      @posts = Post.all.order('created_at DESC')
    end
    @posts = @posts.order(created_at: :DESC).page(params[:page]).per(7)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  posts.*, max(comments.created_at) as last_commented_at FROM "posts" INNER JOIN "comments" ON "comments"."post_id" = "posts"."id" GROUP BY posts.id ORDER BY last_commented_at DESC LIMIT ?  [["LIMIT", 5]]
SELECT  posts.*, count(comments.id) as comment_count FROM "posts" INNER JOIN "comments" ON "comments"."post_id" = "posts"."id" GROUP BY posts.id ORDER BY comment_count DESC LIMIT ?  [["LIMIT", 5]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 9]]
SELECT COUNT(*) FROM "posts"
---
  def show
    @post = Post.find(params[:id])
    @comment = Comment.new
    @lastcommentedposts =  Post.select('posts.*, max(comments.created_at) as last_commented_at').joins(:comments).group('posts.id').order('last_commented_at DESC').limit(5)
    @bestposts = Post.select('posts.*, count(comments.id) as comment_count').joins(:comments).group('posts.id').order('comment_count DESC').limit(5)
    @subscriber = Subscriber.new
    @comments = @post.comments.order(created_at: :DESC).page(params[:page]).per(7)